jimmywong2003/nrf5-gpio-ppi-timer-counter/ble_app_uart/main.c
#include "nrf_drv_ppi.h"
#include "nrf_drv_timer.h"
#include "nrf_drv_gpiote.h"

/* Counter instance to count number of gpio in */
 static nrf_drv_timer_t gpio_press_timer_counter_instance = NRF_DRV_TIMER_INSTANCE(2);

#define APP_BUTTON_PRESS_PIN  BUTTON_4

static uint32_t pin_count_press = 0;

// TWI transfer counter handler.
void gpio_press_counter_handler(nrf_timer_event_t event_type, void * p_context)
{
        NRF_LOG_INFO("gpio_press_counter_handler counter expired");
}

static void gpiote_event_handler(nrf_drv_gpiote_pin_t pin, nrf_gpiote_polarity_t action)
{
        switch (action)
        {
        case NRF_GPIOTE_POLARITY_LOTOHI:
                NRF_LOG_INFO("Low -> High Pin %d, %d", pin, pin_count_press++);
                break;
        case NRF_GPIOTE_POLARITY_HITOLO:
                NRF_LOG_INFO("High -> Pin %d %d", pin, pin_count_press++);
                break;

        case NRF_GPIOTE_POLARITY_TOGGLE:
                NRF_LOG_INFO("Toggle %d %d, %d", pin, pin_count_press++, NRF_TIMER2->CC[0]);
                //NRF_TIMER2->CC[0];
                break;

        default:
                break;

        }
}

static void timer_counter_with_gpio(void)
{
        // Setup TWI tranfer counter
        uint32_t err_code;
        // Variable to store address of counter increment task.
        uint32_t task_address_counter_increment;

        uint32_t event_address_gpio_button;

        // Variable holding PPI channel number
        nrf_ppi_channel_t ppi_channel_gpio_press_count;

        // Set up counter with default configuration
        nrf_drv_timer_config_t counter_config = NRF_DRV_TIMER_DEFAULT_CONFIG;
        counter_config.mode = NRF_TIMER_MODE_COUNTER;

        // Initializing the counter counting the TWI transfers. Passing:
        // Instance of counter
        // Configurations
        // Timer handler. This timer will be triggered when TWIM_RX_BUF_LENGTH number of transfers have completed.
        err_code = nrf_drv_timer_init(&gpio_press_timer_counter_instance, &counter_config, gpio_press_counter_handler);
        APP_ERROR_CHECK(err_code);

        // Configuring the timer triggering the TWI transfers. Passing:
        // Counter instance
        // Capture Compare channel number
        // Number of samples to count
        // Shortcut to clear timer on Capture Compare event
        // Use interrupts
        nrf_drv_timer_extended_compare(&gpio_press_timer_counter_instance, NRF_TIMER_CC_CHANNEL0, 10, NRF_TIMER_SHORT_COMPARE0_CLEAR_MASK, true);

        if (!nrf_drv_gpiote_is_init())
        {
                err_code = nrf_drv_gpiote_init();
                VERIFY_SUCCESS(err_code);
        }

        nrf_drv_gpiote_in_config_t config = GPIOTE_CONFIG_IN_SENSE_TOGGLE(false);

        err_code = nrf_drv_gpiote_in_init(APP_BUTTON_PRESS_PIN, &config, gpiote_event_handler);
        VERIFY_SUCCESS(err_code);

        event_address_gpio_button = nrf_drv_gpiote_in_event_addr_get(APP_BUTTON_PRESS_PIN);

        // Initate ppi driver. Ignore error if driver is already initialized
        err_code = nrf_drv_ppi_init();
        if((err_code != 0) && (err_code != NRF_ERROR_MODULE_ALREADY_INITIALIZED))
        {
                APP_ERROR_CHECK(err_code);
        }

        // Allocate a PPI channel. This function is especially useful when using a softdevice as it will ensure that the the returend PPI channels is free
        err_code = nrf_drv_ppi_channel_alloc(&ppi_channel_gpio_press_count);
        APP_ERROR_CHECK(err_code);

        // Get the address of the counter increment task. This is the register address of the actual counter task. Look in the nRF52 Product Specification -> Timer -> Registers
        task_address_counter_increment = nrf_drv_timer_task_address_get(&gpio_press_timer_counter_instance, NRF_TIMER_TASK_COUNT);

        // Connect the TWI transfer complete event and the counter increment task using the PPI channel
        err_code = nrf_drv_ppi_channel_assign(ppi_channel_gpio_press_count, event_address_gpio_button, task_address_counter_increment);
        APP_ERROR_CHECK(err_code);

        // Enable the PPI channel.
        err_code = nrf_drv_ppi_channel_enable(ppi_channel_gpio_press_count);
        APP_ERROR_CHECK(err_code);

        nrf_drv_gpiote_in_event_enable(APP_BUTTON_PRESS_PIN, true);
}

/**@brief Application main function.
 */
int main(void)
{
        bool erase_bonds;
        ret_code_t err_code;

        /* enable instruction cache */

        NRF_NVMC->ICACHECNF = (NVMC_ICACHECNF_CACHEEN_Enabled << NVMC_ICACHECNF_CACHEEN_Pos) +
                              (NVMC_ICACHECNF_CACHEPROFEN_Disabled << NVMC_ICACHECNF_CACHEPROFEN_Pos);


        // Initialize.
        uart_init();
        log_init();
        timers_init();
        //buttons_init();
        power_management_init();
        ble_stack_init();
        scheduler_init();
        gap_params_init();
        gatt_init();
        services_init();
        advertising_init();
        conn_params_init();

        // Start execution.
        NRF_LOG_INFO("Example how to count GPIO in through TIMER counter mode.");

        advertising_start();
        timer_counter_with_gpio();

        // Enable the counter counting number of GPIO transfers
        nrf_drv_timer_enable(&gpio_press_timer_counter_instance);

        // Enter main loop.
        for (;;)
        {
                idle_state_handle();
        }
}
